# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [4]:
series1 = pd.Series(np.random.randint(low=1, high=4, size=100))
series2 = pd.Series(np.random.randint(low=1, high=3, size=100))
series3 = pd.Series(np.random.randint(low=10000, high=30000, size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [8]:
df = pd.concat(objs=[series1,series2,series3], axis=1)
df.columns = ['s1', 's2', 's3']
df

    s1  s2     s3
0    2   2  22295
1    3   2  25720
2    2   2  11955
3    1   2  10076
4    3   1  23005
..  ..  ..    ...
95   3   2  15605
96   1   2  10440
97   1   1  10694
98   1   1  27539
99   2   2  20831

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [9]:
df.columns = ['bedrs', 'bathrs', 'price_sqr_meter']
df

    bedrs  bathrs  price_sqr_meter
0       2       2            22295
1       3       2            25720
2       2       2            11955
3       1       2            10076
4       3       1            23005
..    ...     ...              ...
95      3       2            15605
96      1       2            10440
97      1       1            10694
98      1       1            27539
99      2       2            20831

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [13]:
big_columns = pd.concat(objs=[series1, series2, series3]).to_frame()

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [14]:
big_columns.shape

(300, 1)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [20]:
big_columns.reset_index(drop=True)

         0
0        2
1        3
2        2
3        1
4        3
..     ...
295  15605
296  10440
297  10694
298  27539
299  20831

[300 rows x 1 columns]